<img src="img/python-logo-notext.svg"
     style="display:block;margin:auto;width:10%"/>
<h1 style="text-align:center;">Python: Pandas Data Frames 2</h1>
<h2 style="text-align:center;">Coding Akademie München GmbH</h2>
<br/>
<div style="text-align:center;">Dr. Matthias Hölzl</div>
<div style="text-align:center;">Allaithy Raed</div>

In [25]:
import numpy as np
import pandas as pd

## Fehlende Werte

In [7]:
def create_data_frame_with_nans():
    return pd.DataFrame({'A': [1, 2, np.nan, np.nan, 0],
                         'B': [5, 6, 7, np.nan, 0],
                         'C': [9, 10, 11, 12, 0],
                         'D': [13, 14, 15, 16, 0],
                         'E': [np.nan, 18, 19, 20, 0]})

In [8]:
df = create_data_frame_with_nans()

In [9]:
df

     A    B   C   D     E
0  1.0  5.0   9  13   NaN
1  2.0  6.0  10  14  18.0
2  NaN  7.0  11  15  19.0
3  NaN  NaN  12  16  20.0
4  0.0  0.0   0   0   0.0

In [14]:
df.isna()

       A      B      C      D      E
0  False  False  False  False   True
1  False  False  False  False  False
2   True  False  False  False  False
3   True   True  False  False  False
4  False  False  False  False  False

In [16]:
df.count()

A    3
B    4
C    5
D    5
E    4
dtype: int64

In [17]:
df

     A    B   C   D     E
0  1.0  5.0   9  13   NaN
1  2.0  6.0  10  14  18.0
2  NaN  7.0  11  15  19.0
3  NaN  NaN  12  16  20.0
4  0.0  0.0   0   0   0.0

In [18]:
df.count(axis=1)

0    4
1    5
2    4
3    3
4    5
dtype: int64

In [13]:
df.isna().sum()

A    2
B    1
C    0
D    0
E    1
dtype: int64

In [19]:
df.isna().sum(axis=1)

0    1
1    0
2    1
3    2
4    0
dtype: int64

In [20]:
df

     A    B   C   D     E
0  1.0  5.0   9  13   NaN
1  2.0  6.0  10  14  18.0
2  NaN  7.0  11  15  19.0
3  NaN  NaN  12  16  20.0
4  0.0  0.0   0   0   0.0

In [21]:
df.dropna()

     A    B   C   D     E
1  2.0  6.0  10  14  18.0
4  0.0  0.0   0   0   0.0

In [22]:
df

     A    B   C   D     E
0  1.0  5.0   9  13   NaN
1  2.0  6.0  10  14  18.0
2  NaN  7.0  11  15  19.0
3  NaN  NaN  12  16  20.0
4  0.0  0.0   0   0   0.0

In [23]:
df.dropna(axis=1, inplace=True)

In [24]:
df

    C   D
0   9  13
1  10  14
2  11  15
3  12  16
4   0   0

In [27]:
df = create_data_frame_with_nans()
df

     A    B   C   D     E
0  1.0  5.0   9  13   NaN
1  2.0  6.0  10  14  18.0
2  NaN  7.0  11  15  19.0
3  NaN  NaN  12  16  20.0
4  0.0  0.0   0   0   0.0

In [28]:
df.fillna(value=1000)

        A       B   C   D       E
0     1.0     5.0   9  13  1000.0
1     2.0     6.0  10  14    18.0
2  1000.0     7.0  11  15    19.0
3  1000.0  1000.0  12  16    20.0
4     0.0     0.0   0   0     0.0

In [34]:
df.fillna(value=df.mean())

     A    B   C   D      E
0  1.0  5.0   9  13  14.25
1  2.0  6.0  10  14  18.00
2  1.0  7.0  11  15  19.00
3  1.0  4.5  12  16  20.00
4  0.0  0.0   0   0   0.00

In [35]:
df.mean()

A     1.00
B     4.50
C     8.40
D    11.60
E    14.25
dtype: float64

In [33]:
# df.fillna(value=df.mean(), axis=1)

## Gruppierung

In [36]:
def create_course_df():
    data = {'Course':['Python','Python','Python','Python','Java','Java','Java','C++','C++'],
            'Person':['Jack', 'Jill', 'John', 'Bill', 'Jack', 'Bill', 'Davy', 'Jack', 'Diane'],
            'Score':[97, 92, 38, 73, 81, 52, 62, 86, 98]}
    return pd.DataFrame(data)

In [37]:
df = create_course_df()
df

   Course Person  Score
0  Python   Jack     97
1  Python   Jill     92
2  Python   John     38
3  Python   Bill     73
4    Java   Jack     81
5    Java   Bill     52
6    Java   Davy     62
7     C++   Jack     86
8     C++  Diane     98

In [38]:
df.groupby('Course')

In [39]:
df_by_course = df.groupby('Course')

In [42]:
df_by_course.count()

        Person  Score
Course
C++          2      2
Java         3      3
Python       4      4

In [44]:
df_by_course['Person'].count()

Course
C++       2
Java      3
Python    4
Name: Person, dtype: int64

In [45]:
df_by_course.mean()

        Score
Course
C++        92
Java       65
Python     75

In [49]:
df_by_course.std()

            Score
Course
C++      8.485281
Java    14.730920
Python  26.745716

In [51]:
df_by_course.aggregate(['mean', 'std'])

       Score
        mean        std
Course
C++       92   8.485281
Java      65  14.730920
Python    75  26.745716

In [53]:
df_by_course.aggregate(['min', 'max'])

       Person       Score
          min   max   min max
Course
C++     Diane  Jack    86  98
Java     Bill  Jack    52  81
Python   Bill  John    38  97

In [55]:
df_by_course['Score'].aggregate(['min', 'max', 'mean', 'std'])

        min  max  mean        std
Course
C++      86   98    92   8.485281
Java     52   81    65  14.730920
Python   38   97    75  26.745716

In [41]:
df.groupby('Person').mean()

        Score
Person
Bill     62.5
Davy     62.0
Diane    98.0
Jack     88.0
Jill     92.0
John     38.0

In [56]:
df_by_course.describe()

       Score
       count  mean        std   min    25%   50%    75%   max
Course
C++      2.0  92.0   8.485281  86.0  89.00  92.0  95.00  98.0
Java     3.0  65.0  14.730920  52.0  57.00  62.0  71.50  81.0
Python   4.0  75.0  26.745716  38.0  64.25  82.5  93.25  97.0

## Nochmal Operationen

In [99]:
df = create_course_df()
df

   Course Person  Score
0  Python   Jack     97
1  Python   Jill     92
2  Python   John     38
3  Python   Bill     73
4    Java   Jack     81
5    Java   Bill     52
6    Java   Davy     62
7     C++   Jack     86
8     C++  Diane     98

In [100]:
df.columns

Index(['Course', 'Person', 'Score'], dtype='object')

In [101]:
df.index

RangeIndex(start=0, stop=9, step=1)

In [102]:
df.sort_values(by='Course')

   Course Person  Score
7     C++   Jack     86
8     C++  Diane     98
4    Java   Jack     81
5    Java   Bill     52
6    Java   Davy     62
0  Python   Jack     97
1  Python   Jill     92
2  Python   John     38
3  Python   Bill     73

In [64]:
df['Course'].values

array(['Python', 'Python', 'Python', 'Python', 'Java', 'Java', 'Java',
       'C++', 'C++'], dtype=object)

In [62]:
df['Person'].values

array(['Jack', 'Jill', 'John', 'Bill', 'Jack', 'Bill', 'Davy', 'Jack',
       'Diane'], dtype=object)

In [58]:
df['Course'].unique()

array(['Python', 'Java', 'C++'], dtype=object)

In [103]:
df['Person'].unique()

array(['Jack', 'Jill', 'John', 'Bill', 'Davy', 'Diane'], dtype=object)

In [104]:
df['Person'].nunique()

6

In [68]:
df['Person'].value_counts()

Jack     3
Bill     2
John     1
Diane    1
Davy     1
Jill     1
Name: Person, dtype: int64

## Selektion

In [65]:
df[df['Score'] > 80]

   Course Person  Score
0  Python   Jack     97
1  Python   Jill     92
4    Java   Jack     81
7     C++   Jack     86
8     C++  Diane     98

In [67]:
df[(df['Score'] > 60) & (df['Score'] <= 80)]

   Course Person  Score
3  Python   Bill     73
6    Java   Davy     62

## Transformation von Daten

In [86]:
df = pd.DataFrame([[1, 2], [3, 4], [5, 6]], columns = ['A', 'B'])

In [87]:
df

   A  B
0  1  2
1  3  4
2  5  6

In [88]:
df.apply(np.square)

    A   B
0   1   4
1   9  16
2  25  36

In [89]:
df.apply(np.sum)

A     9
B    12
dtype: int64

In [90]:
df.apply(np.sum, axis=1)

0     3
1     7
2    11
dtype: int64

In [96]:
df.apply(lambda n: [np.sum(n), np.mean(n)], axis=1)

0     [3, 1.5]
1     [7, 3.5]
2    [11, 5.5]
dtype: object

In [97]:
df.apply(lambda n: [np.sum(n), np.mean(n)], axis=1, result_type='expand')

      0    1
0   3.0  1.5
1   7.0  3.5
2  11.0  5.5

Elementweises Anwenden einer Funktion:

In [82]:
df.applymap(lambda x: f"Value: {x}")

          A         B
0  Value: 1  Value: 2
1  Value: 3  Value: 4
2  Value: 5  Value: 6